// Программа, которая принимает пятизначное число на вход, и проверяет является ли оно палиндромом

Console.Clear();
//Метод проверки четырехзначного числа через словарь
void dictPalindrome()
{
Console.WriteLine("Проверка четырехзначного числа");
Console.WriteLine("Введите Ваше число: ");
string? inputNumberA =  Console.ReadLine();
if (inputNumberA !=null)
{
int inputPalindrome = int.Parse(inputNumberA);

{
Dictionary<int,int>palindromeFour = new Dictionary <int,int>()
{
{1, 1001},
{2, 1111},
{3, 1221},
{4, 1331},
{5, 1441},
{6, 1551},
{7, 1661},
{8, 1771},
{9, 1881},
{10, 1991},
{11, 2002},
{12, 2112},
{13, 2222},
{14, 2332},
{15, 2442},
{16, 2552},
{17, 2662},
{18, 2772},
{19, 2882},
{20, 2992},
{21, 3003},
{22, 3113},
{23, 3223},
{24, 3333},
{25, 3443},
{26, 3553},
{27, 3663},
{28, 3773},
{29, 3883},
{30, 3993},
{31, 4004},
{32, 4114},
{33, 4224},
{34, 4334},
{35, 4444},
{36, 4554},
{37, 4664},
{38, 4774},
{39, 4884},
{40, 4994},
{41, 5005},
{42, 5115},
{43, 5225},
{44, 5335},
{45, 5445},
{46, 5555},
{47, 5665},
{48, 5775},
{49, 5885},
{50, 5995},
{51, 6006},
{52, 6116},
{53, 6226},
{54, 6336},
{55, 6446},
{56, 6556},
{57, 6666},
{58, 6776},
{59, 6886},
{60, 6996},
{61, 7007},
{62, 7117},
{63, 7227},
{64, 7337},
{65, 7447},
{66, 7557},
{67, 7667},
{68, 7777},
{69, 7887},
{70, 7997},
{71, 8008},
{72, 8118},
{73, 8228},
{74, 8338},
{75, 8448},
{76, 8558},
{77, 8668},
{78, 8778},
{79, 8888},
{80, 8998},
{81, 9009},
{82, 9119},
{83, 9229},
{84, 9339},
{85, 9449},
{86, 9559},
{87, 9669},
{88, 9779},
{89, 9889},
{90, 9999}
};
bool value = palindromeFour.ContainsValue(inputPalindrome);
if(value == true)
{
    Console.WriteLine("Введенное число " + inputPalindrome + " является палиндромом");
}
else
{
    Console.WriteLine("Число не является палиндромом");
}

}
}
}


//Метод проверки 5-ти значного числа через сравнение элементов
void testPalindrome()
{
Console.WriteLine("Проверка пятизначного числа");
Console.WriteLine("Введите число");
string? inputNumber =  Console.ReadLine();
if (inputNumber !=null)
{
    int number = int.Parse(inputNumber);
    int digit1 = (number/10000);
    int digit2 = (number/1000)%10;
    int digit3 = (number/100)%10;
    int digit4 = (number/10)%10;
    int digit5 = number%10;
    if (digit1 == digit5 && digit2 == digit4)
    {
        Console.WriteLine("Число является палиндромом");
    }
    else
    {
        Console.WriteLine("Число не является палиндромом");
    }
}
}

dictPalindrome();

testPalindrome();

